[
  {
    "_id": 1,
    "projectName": "Basa Khuji.com",
    "liveLink": "https://basa-khuji-next-client.vercel.app/",
    "clientRepo": "https://github.com/shaikot07/BasaKhuji-next-client",
    "serverRepo": "https://github.com/shaikot07/Basakhuji-server",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746030129/basha_khuji_full_fubcmr.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746030129/basha_khuji_full_fubcmr.png",
    "projectOverview": [
  "BashaKhuji.com is a complete, role-based rental housing platform connecting tenants and landlords efficiently and securely.",
  "Built with Next.js, TypeScript, Node.js, and MongoDB for scalability and performance.",
  "Tailored dashboards and features for three roles: Tenant, Landlord, and Admin.",
  "Landlords can easily post detailed property listings.",
  "Tenants can search rentals using smart filters (location, rent, number of bedrooms).",
  "Rental requests, approvals, and payments are managed in one unified system.",
  "Secure payment gateway (ShurjoPay) integrated for finalizing rentals.",
  "Email notifications keep users informed of real-time updates.",
  "Role-based authentication with JWT and bcrypt ensures secure access and password protection.",
  "Fully responsive UI optimized for mobile, tablet, and desktop.",
  "SEO-friendly and high-performance rendering using Next.js.",
  "RESTful APIs support scalability and future extensibility.",
  "Clean, modular codebase for reusability and maintainability.",
  "End-to-end solution with a strong focus on usability, security, and performance."
],
    "tools": [
      "Next.js",
     "TypeScript",
      "Node.js",
      "Express.js",
      "MongoDB",
      "Tailwind CSS",
      "shadcn/ui",
      "JWT (JSON Web Tokens)",
      "bcrypt (password hashing)",
      "ShurjoPay (Payment Gateway)",
      "Express.js",
      "Next.js",
      "HTML",
      "CSS"
    ]
  },
  {
    "_id": 2,
    "projectName": "Bike House",
    "liveLink": "https://bike-house-l2-as4.netlify.app/",
    "clientRepo": "https://github.com/shaikot07/bike-house-client",
    "serverRepo": "https://github.com/shaikot07/l-2-assignment-2-bike-store-server",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746030443/bike_house_i4agpb.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746030443/bike_house_i4agpb.png",
    "projectOverview": "Bike House is a comprehensive e-commerce web application designed to facilitate the buying and selling of bikes through a clean, responsive, and user-friendly interface. Built using the MERN stack—React with TypeScript on the frontend and Node.js with Express.js on the backend—the application offers a seamless experience for both customers and administrators.\n\nThe platform features secure JWT-based authentication, allowing users to register and log in with hashed passwords. Role-based access control is implemented so that customers and admins have distinct dashboard capabilities. While customers can manage their orders and profile, admins have full control over users, products, and orders through complete CRUD operations.\n\nThe frontend allows users to search and filter bikes by brand, category, model, price range, and availability. Each product displays key details along with “View Details” and “Buy Now” options that direct users to a secure checkout page. The payment system is integrated with SurjoPay for smooth and reliable transactions.\n\nPublic routes include the homepage, all products page, individual product detail views, and an about page. Private routes, accessible only after login, include the checkout page and dashboards. The system ensures stock availability before processing orders and calculates the total price dynamically.\n\nDeployment is handled via Netlify for the frontend and Vercel for the backend, ensuring optimal performance and uptime. All sensitive data is securely managed using environment variables.\n\nPlanned future enhancements include a wishlist and cart feature, user reviews and ratings, order tracking, and email notifications for order updates.",
    "tools": [
      "React",
      "TypeScript",
      "Tailwind CSS",
      "Node.js",
      "Express.js",
      "MongoDB",
      "JWT",
      "Redux Toolkit",
      "SurjoPay"
    ]
  },
  {
    "_id": 3,
    "projectName": "Daily Pulse Newspaper",
    "liveLink": "https://assignment-12-cb947.web.app/",
    "clientRepo": "https://github.com/shaikot07/Daily-Pulse-client-side",
    "serverRepo": "https://github.com/shaikot07/Daily-Pulse-server-side",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746032250/S-02_n4kijl.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746032250/S-02_n4kijl.png",
    "projectOverview": "Welcome to Daily Pulse, your go-to source for the latest news and insights. Our website, meticulously crafted using React for the client-side, promises a dynamic, interactive, and user-friendly platform for news enthusiasts. Leveraging Firebase and Express for server-side operations ensures a seamless and efficient experience. Dive into a diverse range of news categories and engage with a community of informed readers. One of our standout features is the ability for users to actively contribute by posting articles. With a simple sign-up process, users can share their perspectives, ensuring a diverse range of voices. To maintain quality, our admin team carefully approves each article, upholding the standards of Daily Pulse. For a more enhanced experience, we offer a premium membership option. Subscribers can enjoy exclusive content, early access to breaking news, and an ad-free reading environment. Daily Pulse is not just a news platform; it's a dynamic community where information meets engagement, and users shape the conversation. Stay informed, stay connected",
    "tools": [
      "HTML",
      "CSS",
      "JavaScript",
      "React",
      "Firebase",
      "Express JS"
    ]
  },
  {
    "_id": 4,
    "projectName": "FitnesHome",
    "liveLink": "https://assignment-11-clint-side-8097e.web.app/",
    "clientRepo": "https://github.com/shaikot07/fitness-Home-client-side",
    "serverRepo": "https://github.com/shaikot07/fitness-Home-server-side",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746272592/fitneshome_uddbac.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746272592/fitneshome_uddbac.png",
    "projectOverview": "FitnesHome is a full-stack, responsive web application that allows users to add, manage, and promote their own fitness services. Users can create new services, view a personalized list of their added services, and perform update or delete operations as needed. The application includes protected routes, ensuring that only authenticated users can access certain pages, with secure login implemented using JSON Web Tokens (JWT). The home page is fully responsive across all devices, offering a smooth user experience. Additionally, the site features engaging animations through lottie-react, and a fully functional contact form integrated with EmailJS, enabling real-time communication. FitnesHome combines user-friendly design with essential functionality to support the fitness community online.",
    "tools": [
      "React",
      "Tailwind CSS",
      "JavaScript",
      "Express.js",
      "Node.js",
      "MongoDB",
      "JWT (JSON Web Token)",
      "Lottie-react",
      "EmailJS",
      "React Router",
      "Private Routes",
      "Responsive Design"
    ]
  },
  {
    "_id": 5,
    "projectName": "My Task Planner ",
    "liveLink": "https://new-task-managment-app.netlify.app/",
    "clientRepo": "https://github.com/shaikot07/my-task-management-clint-side",
    "serverRepo": "https://github.com/shaikot07/my-task-management-server-side-",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273802/task_vloiq6.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273802/task_vloiq6.png",
    "projectOverview": "The Task Management App is a responsive and user-friendly application built to help users efficiently manage their daily tasks. Users can add, update, and delete tasks with ease through an intuitive interface. The application features real-time data updates and organizes tasks based on their status or priority. Private routes are implemented to ensure only authenticated users can access task-related features, and secure login is managed using Firebase Authentication. The app provides error handling and user feedback for better interaction, while maintaining full responsiveness across mobile, tablet, and desktop devices.",
    "tools": [
      "React",
      "Tailwind CSS",
      "JavaScript",
      "Firebase Authentication",
      "React Router",
      "Private Routes",
      "Responsive Design",
      "CRUD Operations",
      "Real-Time UI Updates"
    ]
  },
  {
    "_id": 6,
    "projectName": "CarHub ",
    "liveLink": "https://assignment-10-clint-side.netlify.app/",
    "clientRepo": "https://github.com/shaikot07/car-hub-client-side",
    "serverRepo": "https://github.com/shaikot07/my-task-management-server-side-",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273113/carhub_vxl58u.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273113/carhub_vxl58u.png",
    "projectOverview": "CarHub is a responsive web application designed for managing and purchasing cars online. The site features secure user authentication using Firebase, allowing users to register new accounts and log in with valid email and password credentials. Incorrect login attempts are blocked to ensure security. Private routes are implemented to restrict access to certain pages unless the user is logged in. The entire interface is fully mobile-responsive for a smooth experience across all devices. Users can browse cars and add them to their cart, with selected products saved to a MongoDB database. The  page displays all the products the user has added, providing a streamlined and personalized shopping experience.",
    "tools": [
      "React",
      "Tailwind CSS",
      "JavaScript",
      "Firebase Authentication",
      "Express.js",
      "Node.js",
      "MongoDB",
      "React Router",
      "Private Routes",
      "Responsive Design"
    ]
  },
  {
    "_id": 7,
    "projectName": "Event-management ",
    "liveLink": "https://entertainment-management-ph-9.netlify.app/",
    "clientRepo": "https://github.com/shaikot07/Entertainment--Event-management",
    "serverRepo": "https://github.com/shaikot07/Entertainment--Event-management",
    "projectImg": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273423/even_aylfem.png",
    "projectBanner": "https://res.cloudinary.com/dy0b6hvog/image/upload/v1746273423/even_aylfem.png",
    "projectOverview": "This project is a fully responsive web application featuring a clean and modern UI optimized for both mobile and tablet devices. It includes a responsive navigation bar that adjusts seamlessly across screen sizes. Data for cards is loaded dynamically, offering a scalable and interactive experience. Private routes are implemented to ensure that only authenticated users can access protected pages. The login system includes password verification with clear error feedback displayed in the UI for invalid credentials. The app is designed with user experience and security in mind, combining responsive design with authentication logic for a robust frontend experience.",
    "tools": [
      "React",
      "Tailwind CSS",
      "JavaScript",
      "Firebase Authentication",
      "React Router",
      "Private Routes",
      "Responsive Design",
      "Dynamic Data Loading",
      "Form Validation & Error Handling"
    ]
  }
]